# TITANIC DATA ANALYSIS

In [2]:
import pandas as pd

In [41]:
df=pd.read_csv("D:\\Statistics\\data\\titanic.csv")

In [4]:
df

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [42]:
# df.head()  # First 5 rows
# print()
df.columns  # Column names
print()
df.info() # Data types and missing values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   gender       891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [43]:
print("Total Number of Passengers:=",df.gender.count())

Total Number of Passengers:= 891

In [44]:
df[(df.gender=="male")].shape

(577, 12)

In [45]:
df[(df.gender=="female")].shape

(314, 12)

In [18]:
print("Total Number of Male Passengers:= 577")
print("Total Number of Female Passengers:= 314")

Total Number of Male Passengers:= 577
Total Number of Female Passengers:= 314

In [23]:
# HOW MUCH PASSENGERS SURVIVED?
# HOW MUCH MALE AND FEMALE PASSENGERS SURVIVED?

In [24]:
df[(df.Survived==1)].shape #number of passengers survived

(342, 12)

In [20]:
df[(df.gender=="male") & (df.Survived==1)].shape

(109, 12)

In [21]:
df[(df.gender=="female") & (df.Survived==1)].shape

(233, 12)

In [25]:
print("Total Number of Passengers Survived:= 342")
print("Total Number of Male Passengers Survived:= 109")
print("Total Number of Female Passengers Survived:= 233")

Total Number of Passengers Survived:= 342
Total Number of Male Passengers Survived:= 109
Total Number of Female Passengers Survived:= 233

In [ ]:
# HOW MUCH PASSENGERS DIED?
# HOW MUCH MALE AND FEMALE PASSENGER DIED?

In [26]:
df[(df.Survived==0)].shape

(549, 12)

In [28]:
df[(df.Survived==0) & (df.gender=="male")].shape

(468, 12)

In [29]:
df[(df.Survived==0) & (df.gender=="female")].shape

(81, 12)

In [30]:
print("Total Number of Passengers Died:= 549")
print("Total Number of Male Passengers Died:= 468")
print("Total Number of Female Passengers Died:= 81")

Total Number of Passengers Died:= 549
Total Number of Male Passengers Died:= 468
Total Number of Female Passengers Died:= 81

In [31]:
# PERCENTAGE % OF PASSENGERS SURVIVED  AND DIED

In [6]:
print("Total Number of Passengers Survived:= 342")
print("Percentage % of Passengers Survived:=",(342/891)*100,"%") #total passenger survived/total passengers

Total Number of Passengers Survived:= 342
Percentage % of Passengers Survived:= 38.38383838383838 %

In [1]:
print("Total Number of Passengers Died:= 549")
print("Percentage % of Passengers Died:=",(549/891)*100,"%") #total passenger died/total passengers

Total Number of Passengers Died:= 549
Percentage % of Passengers Died:= 61.61616161616161 %

In [ ]:
# PERCENTAGE % OF MALE AND FEMALE DIED

In [34]:
print("Total Number of Male Passengers Died:= 468")
print("Percentage % of Male Passengers Died:=",(468/577)*100,"%") #total male passenger died/total male passengers

Total Number of Male Passengers Died:= 468
Percentage % of Male Passengers Died:= 81.10918544194108 %

In [35]:
print("Total Number of Female Passengers Died:= 81")
print("Percentage % of Female Passengers Died:=",(81/314)*100,"%") #total female passenger died/total female passengers

Total Number of Female Passengers Died:= 81
Percentage % of Female Passengers Died:= 25.796178343949045 %

In [3]:
# PERCENTAGE % OF MALE AND FEMALE SURVIVED

In [4]:
print("Total Number of Male Passengers Survived:= 109")
print("Percentage % of Male Passengers Survived:=",(109/577)*100,"%") #total male passenger survived/total male passengers

Total Number of Male Passengers Survived:= 109
Percentage % of Male Passengers Survived:= 18.890814558058924 %

In [5]:
print("Total Number of Female Passengers Survived:= 233")
print("Percentage % of Female Passengers Survived:=",(233/314)*100,"%") #total female passenger survived/total female passengers

Total Number of Female Passengers Survived:= 233
Percentage % of Female Passengers Survived:= 74.20382165605095 %

In [8]:
print("Percentage % of Passengers Survived:=",(342/891)*100,"%")
print("Percentage % of Passengers Died:=",(549/891)*100,"%")
print()
print("Percentage % of Male Passengers Survived:=",(109/577)*100,"%")
print("Percentage % of Female Passengers Survived:=",(233/314)*100,"%")
print()
print("Percentage % of Male Passengers Died:=",(468/577)*100,"%")
print("Percentage % of Female Passengers Died:=",(81/314)*100,"%")

Percentage % of Passengers Survived:= 38.38383838383838 %
Percentage % of Passengers Died:= 61.61616161616161 %

Percentage % of Male Passengers Survived:= 18.890814558058924 %
Percentage % of Female Passengers Survived:= 74.20382165605095 %

Percentage % of Male Passengers Died:= 81.10918544194108 %
Percentage % of Female Passengers Died:= 25.796178343949045 %

In [36]:
# RESULTS SHOWS THE MALE CASUALITIES ARE HIGHER THAN FEMALE CASUALITIES

In [37]:
# HOW MUCH PASSENGERS ARE IN CLASS 1,2,AND 3?
 # HOW MUCH MALE IN FEMALE PASSENGERS IN CLASS 1,2,AND 3?

In [39]:
df[df.Pclass==1].shape

(216, 12)

In [40]:
df[df.Pclass==2].shape

(184, 12)

In [41]:
df[df.Pclass==3].shape

(491, 12)

In [43]:
print("Total Number of Pasengers in class 1:=216")
print("Total Number of Pasengers in class 2:=184")
print("Total Number of Pasengers in class 3:=491")

Total Number of Pasengers in class 1:=216
Total Number of Pasengers in class 2:=184
Total Number of Pasengers in class 3:=491

In [44]:
df[(df.Pclass==1)&(df.gender=="male")].shape

(122, 12)

In [45]:
df[(df.Pclass==1)&(df.gender=="female")].shape

(94, 12)

In [46]:
print("Total Number of Male Pasengers in class 1:=122")
print("Total Number of Female Pasengers in class 1:=94")

Total Number of Male Pasengers in class 1:=122
Total Number of Female Pasengers in class 1:=94

In [47]:
df[(df.Pclass==2)&(df.gender=="male")].shape

(108, 12)

In [48]:
df[(df.Pclass==2)&(df.gender=="female")].shape

(76, 12)

In [49]:
print("Total Number of Male Pasengers in class 2:=108")
print("Total Number of Female Pasengers in class 2:=76")

Total Number of Male Pasengers in class 2:=108
Total Number of Female Pasengers in class 2:=76

In [50]:
df[(df.Pclass==3)&(df.gender=="male")].shape

(347, 12)

In [51]:
df[(df.Pclass==3)&(df.gender=="female")].shape

(144, 12)

In [52]:
print("Total Number of Male Pasengers in class 3:=347")
print("Total Number of Female Pasengers in class 3:=144")

Total Number of Male Pasengers in class 3:=347
Total Number of Female Pasengers in class 3:=144

In [64]:
# total passnegers in class 1,2,and3
print("Total Number of Pasengers in class 1:=216")
print("Total Number of Pasengers in class 2:=184")
print("Total Number of Pasengers in class 3:=491")
print()
# total amle and female passengers in class1,2and3
print("Total Number of Male Pasengers in class 1:=122")
print("Total Number of Female Pasengers in class 1:=94")
print()
print("Total Number of Male Pasengers in class 2:=108")
print("Total Number of Female Pasengers in class 2:=76")
print()
print("Total Number of Male Pasengers in class 3:=347")
print("Total Number of Female Pasengers in class 3:=144")

Total Number of Pasengers in class 1:=216
Total Number of Pasengers in class 2:=184
Total Number of Pasengers in class 3:=491

Total Number of Male Pasengers in class 1:=122
Total Number of Female Pasengers in class 1:=94

Total Number of Male Pasengers in class 2:=108
Total Number of Female Pasengers in class 2:=76

Total Number of Male Pasengers in class 3:=347
Total Number of Female Pasengers in class 3:=144

In [53]:
# TOTAL NUMBER OF PASSENGERS SURVIVED AND DIED IN CLASS 1,2,AND 3
# TOTAL NUMBER OF mALE AND FEMALE PASSENGERS SURVIVED AND DIED IN CLASS 1,2,AND3

In [54]:
df[(df.Pclass==1)&(df.Survived==1)].shape

(136, 12)

In [55]:
df[(df.Pclass==1)&(df.Survived==0)].shape

(80, 12)

In [56]:
print("Total Number of Passengers Survived in Class 1:=136")
print("Total Number of Passengers Died in Class 1:=80")

Total Number of Passengers Survived in Class 1:=136
Total Number of Passengers Died in Class 1:=80

In [65]:
# get gender also
#CLASS 1

In [68]:
df[(df.Pclass==1)&(df.Survived==1)&(df.gender=="male")].shape

(45, 12)

In [69]:
df[(df.Pclass==1)&(df.Survived==1)&(df.gender=="female")].shape

(91, 12)

In [70]:
print("Total Number of Male Passengers Survived in Class 1:=45")
print("Total Number of Female Passengers Survived in Class 1:=91")

Total Number of Male Passengers Survived in Class 1:=45
Total Number of Female Passengers Survived in Class 1:=91

In [71]:
df[(df.Pclass==1)&(df.Survived==0)&(df.gender=="male")].shape

(77, 12)

In [72]:
df[(df.Pclass==1)&(df.Survived==0)&(df.gender=="female")].shape

(3, 12)

In [73]:
print("Total Number of Male Passengers Died in Class 1:=77")
print("Total Number of Female Passengers Died in Class 1:=3")

Total Number of Male Passengers Died in Class 1:=77
Total Number of Female Passengers Died in Class 1:=3

In [ ]:
#CLASS 2

In [16]:
df[(df.Pclass==2)&(df.Survived==1)].shape

(87, 12)

In [17]:
df[(df.Pclass==2)&(df.Survived==0)].shape

(97, 12)

In [20]:
print("Total Number of Passengers Survived in Class 2:=87")
print("Total Number of Passengers Died in Class 2:=97")

Total Number of Passengers Survived in Class 2:=87
Total Number of Passengers Died in Class 2:=97

In [74]:
df[(df.Pclass==2)&(df.Survived==1)&(df.gender=="male")].shape

(17, 12)

In [75]:
df[(df.Pclass==2)&(df.Survived==1)&(df.gender=="female")].shape

(70, 12)

In [76]:
print("Total Number of Male Passengers Survived in Class 2:=17")
print("Total Number of Female Passengers Survived in Class 2:=70")

Total Number of Male Passengers Survived in Class 2:=17
Total Number of Female Passengers Survived in Class 2:=70

In [77]:
df[(df.Pclass==2)&(df.Survived==0)&(df.gender=="male")].shape

(91, 12)

In [78]:
df[(df.Pclass==2)&(df.Survived==0)&(df.gender=="female")].shape

(6, 12)

In [80]:
print("Total Number of Male Passengers Died in Class 2:=91")
print("Total Number of Female Passengers Died in Class 2:=6")

Total Number of Male Passengers Died in Class 2:=91
Total Number of Female Passengers Died in Class 2:=6

In [19]:
#CLASS 3

In [21]:
df[(df.Pclass==3)&(df.Survived==1)].shape

(119, 12)

In [22]:
df[(df.Pclass==3)&(df.Survived==0)].shape

(372, 12)

In [23]:
print("Total Number of Passengers Survived in Class 3:=119")
print("Total Number of Passengers Died in Class 3:=372")

Total Number of Passengers Survived in Class 3:=119
Total Number of Passengers Died in Class 3:=372

In [83]:
df[(df.Pclass==3)&(df.Survived==1)&(df.gender=="male")].shape

(47, 12)

In [84]:
df[(df.Pclass==3)&(df.Survived==1)&(df.gender=="female")].shape

(72, 12)

In [85]:
print("Total Number of Male Passengers Survived in Class 3:=47")
print("Total Number of Female Passengers Survived in Class 3:=72")

Total Number of Male Passengers Survived in Class 3:=47
Total Number of Female Passengers Survived in Class 3:=72

In [86]:
df[(df.Pclass==3)&(df.Survived==0)&(df.gender=="male")].shape

(300, 12)

In [89]:
df[(df.Pclass==3)&(df.Survived==0)&(df.gender=="female")].shape

(72, 12)

In [90]:
print("Total Number of Male Passengers Died in Class 3:=300")
print("Total Number of Female Passengers Died in Class 3:=72")

Total Number of Male Passengers Died in Class 3:=300
Total Number of Female Passengers Died in Class 3:=72

In [81]:
# PERCENTAGE % OF MALE AND FEMALE SURVIVED AND DIED IN CLASS 1,2,AND 3

In [92]:
print("Total Number of Male Passengers Died in class 1:= 77")
print("Percentage % of Male Passengers Died in class 1:=",(77/122)*100,"%") #total male passenger died/total male passengers

Total Number of Male Passengers Died in class 1:= 77
Percentage % of Male Passengers Died in class 1:= 63.114754098360656 %

In [93]:
print("Total Number of Female Passengers Died in class 1:= 3")
print("Percentage % of Female Passengers Died in class 1:=",(3/94)*100,"%") #total female passenger died/total female passengers

Total Number of Female Passengers Died in class 1:= 3
Percentage % of Female Passengers Died in class 1:= 3.1914893617021276 %

In [94]:
print("Total Number of Male Passengers Died in class 2:= 97")
print("Percentage % of Male Passengers Died in class 2:=",(97/184)*100,"%") #total male passenger died/total male passengers

Total Number of Male Passengers Died in class 2:= 97
Percentage % of Male Passengers Died in class 2:= 52.71739130434783 %

In [95]:
print("Total Number of Female Passengers Died in class 2:= 6")
print("Percentage % of Female Passengers Died in class 2:=",(6/76)*100,"%") #total female passenger died/total female passengers

Total Number of Female Passengers Died in class 2:= 6
Percentage % of Female Passengers Died in class 2:= 7.894736842105263 %

In [97]:
print("Total Number of Male Passengers Died in class 3:= 300")
print("Percentage % of Male Passengers Died in class 3:=",(300/347)*100,"%") #total male passenger died/total male passengers

Total Number of Male Passengers Died in class 3:= 300
Percentage % of Male Passengers Died in class 3:= 86.45533141210375 %

In [98]:
print("Total Number of Female Passengers Died in class 3:= 72")
print("Percentage % of Female Passengers Died in class 3:=",(72/144)*100,"%") #total male passenger died/total male passengers

Total Number of Female Passengers Died in class 3:= 72
Percentage % of Female Passengers Died in class 3:= 50.0 %

In [27]:
print("Percentage % of Male Passengers Died in class 1:=",(77/122)*100,"%")
print("Percentage % of Female Passengers Died in class 1:=",(3/94)*100,"%")
print()
print("Percentage % of Male Passengers Died in class 2:=",(91/108)*100,"%")
print("Percentage % of Female Passengers Died in class 2:=",(6/76)*100,"%")
print()
print("Percentage % of Male Passengers Died in class 3:=",(300/347)*100,"%") 
print("Percentage % of Female Passengers Died in class 3:=",(72/144)*100,"%")

Percentage % of Male Passengers Died in class 1:= 63.114754098360656 %
Percentage % of Female Passengers Died in class 1:= 3.1914893617021276 %

Percentage % of Male Passengers Died in class 2:= 84.25925925925925 %
Percentage % of Female Passengers Died in class 2:= 7.894736842105263 %

Percentage % of Male Passengers Died in class 3:= 86.45533141210375 %
Percentage % of Female Passengers Died in class 3:= 50.0 %

In [28]:
print("Percentage % of Male Passengers Survived in class 1:=",(45/122)*100,"%")
print("Percentage % of Female Passengers Survived in class 1:=",(91/94)*100,"%")
print()
print("Percentage % of Male Passengers Survived in class 2:=",(17/108)*100,"%")
print("Percentage % of Female Passengers Survived in class 2:=",(70/76)*100,"%")
print()
print("Percentage % of Male Passengers Survived in class 3:=",(47/347)*100,"%") 
print("Percentage % of Female Passengers Survived in class 3:=",(72/144)*100,"%")

Percentage % of Male Passengers Survived in class 1:= 36.885245901639344 %
Percentage % of Female Passengers Survived in class 1:= 96.80851063829788 %

Percentage % of Male Passengers Survived in class 2:= 15.74074074074074 %
Percentage % of Female Passengers Survived in class 2:= 92.10526315789474 %

Percentage % of Male Passengers Survived in class 3:= 13.544668587896252 %
Percentage % of Female Passengers Survived in class 3:= 50.0 %

In [29]:
print("Total Number of Passengers Survived in Class 1:=136")
print("Total Number of Passengers Died in Class 1:=80")
print()
print("Total Number of Passengers Survived in Class 2:=87")
print("Total Number of Passengers Died in Class 2:=97")
print()
print("Total Number of Passengers Survived in Class 3:=119")
print("Total Number of Passengers Died in Class 3:=372")

Total Number of Passengers Survived in Class 1:=136
Total Number of Passengers Died in Class 1:=80

Total Number of Passengers Survived in Class 2:=87
Total Number of Passengers Died in Class 2:=97

Total Number of Passengers Survived in Class 3:=119
Total Number of Passengers Died in Class 3:=372

In [30]:
print("Percentage % of total Passengers Survived in class 1:=",(136/216)*100,"%")
print("Percentage % of total Passengers Died in class 1:=",(80/216)*100,"%")
print()
print("Percentage % of total Passengers Survived in class 2:=",(87/184)*100,"%")
print("Percentage % of total Passengers Died in class 2:=",(97/184)*100,"%")
print()
print("Percentage % of total Passengers Survived in class 3:=",(119/491)*100,"%") 
print("Percentage % of total Passengers Died in class 3:=",(372/491)*100,"%")

Percentage % of total Passengers Survived in class 1:= 62.96296296296296 %
Percentage % of total Passengers Died in class 1:= 37.03703703703704 %

Percentage % of total Passengers Survived in class 2:= 47.28260869565217 %
Percentage % of total Passengers Died in class 2:= 52.71739130434783 %

Percentage % of total Passengers Survived in class 3:= 24.236252545824847 %
Percentage % of total Passengers Died in class 3:= 75.76374745417516 %

In [31]:
df

,PassengerId,Survived,Pclass,Name,gender,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [33]:
df.groupby(by="gender").Age.agg(["mean","min","max"])

             mean   min   max
gender
female  27.915709  0.75  63.0
male    30.726645  0.42  80.0

In [35]:
df.groupby(by="Embarked").Pclass.agg(["mean","min","max"])

              mean  min  max
Embarked
C         1.886905    1    3
Q         2.909091    1    3
S         2.350932    1    3

In [38]:
df[(df.Embarked=="S")].shape

(644, 12)

In [39]:
df[(df.Embarked=="Q")].shape

(77, 12)

In [40]:
df[(df.Embarked=="C")].shape

(168, 12)

In [41]:
print(df.Embarked.count())

889

In [42]:
df[(df.Embarked=="S")&(df.gender=="male")].shape

(441, 12)

In [43]:
df[(df.Embarked=="S")&(df.gender=="female")].shape

(203, 12)

In [44]:
df[(df.Embarked=="Q")&(df.gender=="male")].shape

(41, 12)

In [45]:
df[(df.Embarked=="Q")&(df.gender=="female")].shape

(36, 12)

In [46]:
df[(df.Embarked=="C")&(df.gender=="male")].shape

(95, 12)

In [47]:
df[(df.Embarked=="C")&(df.gender=="female")].shape

(73, 12)

In [48]:
print("Total Number of Embarked from S = 644")
print("Total Number of Embarked from Q = 77")
print("Total Number of Embarked from C = 168")

Total Number of Embarked from S = 644
Total Number of Embarked from Q = 77
Total Number of Embarked from C = 168

In [49]:
print("Total Number of Male Embarked from S = 441")
print("Total Number of Female Embarked from S = 203")
print("Total Number of Male Embarked from Q = 41")
print("Total Number of Female Embarked from Q = 36")
print("Total Number of Male Embarked from C = 95")
print("Total Number of Female Embarked from C = 73")

Total Number of Male Embarked from S = 441
Total Number of Female Embarked from S = 203
Total Number of Male Embarked from Q = 41
Total Number of Female Embarked from Q = 36
Total Number of Male Embarked from C = 95
Total Number of Female Embarked from C = 73

In [51]:
df.pivot_table(index="gender",values="Fare",aggfunc=["sum","mean","min","max"])

               sum       mean   min       max
              Fare       Fare  Fare      Fare
gender
female  13966.6628  44.479818  6.75  512.3292
male    14727.2865  25.523893  0.00  512.3292

In [19]:
df.pivot_table(index=["gender","Pclass","Survived"],values="Fare",aggfunc=["sum","mean","min","max"])

                              sum        mean      min       max
                             Fare        Fare     Fare      Fare
gender Pclass Survived
female 1      0          331.8125  110.604167  28.7125  151.5500
              1         8843.6209  107.849035  25.9292  512.3292
       2      0          109.5000   18.250000  10.5000   26.0000
              1         1514.8792   22.277635  10.5000   65.0000
       3      0         1016.0876   18.474320   6.7500   46.9000
              1          603.2000   12.834043   7.2250   31.3875
male   1      0         3978.9915   65.229369   0.0000  263.0000
              1         3206.4294   80.160735  26.2875  512.3292
       2      0         1758.4458   20.933879  10.5000   73.5000
              1          331.7542   22.116947  10.5000   39.0000
       3      0         2542.5161   11.825656   0.0000   56.4958
              1          534.6458   14.069626   0.0000   56.4958

In [47]:
# df.pivot_table(index=["Age",gender=="male"],values="Survived",aggfunc="mean")